Thank you for reporting the issue!

I think I can reproduce the issue with upstream also. The previous Pulumi provider version was based on approximately 3.4.0 of upstream, and the new one is ahead of 4.0.4, but even with these versions TF generates replacement plans. There is also https://github.com/hashicorp/terraform-provider-tls/issues/263

The ideal case for us would be if upstream TF provider implemented [state upgrades](https://developer.hashicorp.com/terraform/plugin/framework/resources/state-upgrade) to seamlessly make these upgrades happen. I'll explore what else we can do in the meanwhile.

```
terraform {
  required_providers {
    tls = {
      source = "hashicorp/tls"
      # version = "3.4.0"
      version = "4.0.4"
    }
  }
}

resource "tls_private_key" "test_key" {
  algorithm = "RSA"
  rsa_bits = 2048
}

resource "tls_self_signed_cert" "test_cert" {
    allowed_uses = []
    private_key_pem = tls_private_key.test_key.private_key_pem
    validity_period_hours = 17532
    subject {
      common_name = "test"
    }
    is_ca_certificate = true
}
```

```
t0yv0@Antons-MacBook-Pro> terraform plan                                                                                                                                                        ~/tmp/2023/02/pulumi-tls-173
tls_private_key.test_key: Refreshing state... [id=dbdaeca811cd34307f45e80da8b5252bdbb639e8]
tls_self_signed_cert.test_cert: Refreshing state... [id=66944529544721065207896626692832922643]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tls_self_signed_cert.test_cert must be replaced
-/+ resource "tls_self_signed_cert" "test_cert" {
      ~ cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIC2jCCAcKgAwIBAgIQMl0MItHkoS3z+FJ5k+yMEzANBgkqhkiG9w0BAQsFADAP
            MQ0wCwYDVQQDEwR0ZXN0MB4XDTIzMDIxNTE1NDcwNVoXDTI1MDIxNTAzNDcwNVow
            DzENMAsGA1UEAxMEdGVzdDCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEB
            AKNUeRwxiA3fMrXYO+YbHmHZpEfs1lFfFPI32ux/RYJA2y31/C6wIdNkK8AUcnGw
            sYuURDIVxvv1UuiaOnTaqYfO+I77vtBOAMJiq7WxM6iC4pYwUTM6+07UOFAbkrMO
            M70vY6dS9TAhirexB/Y3vRgJ9G7kiym4PzlKKF3AlYzyFLYPFPCYJZjTPOEaCJ3S
            LaQNNEQT0NufxZfonnqhx02MMKrqyytKU3eT750DQdZISGJGeNEY8ldpOyw0DK8Y
            xTuHqLwSyf7VCbug3qJUp/1yOgh/fZSm+xLgzmA3q5NaDGl4kwHyEAi4xGD2NENq
            c5CgxnxGi7bTPORWJsCB6IcCAwEAAaMyMDAwDwYDVR0TAQH/BAUwAwEB/zAdBgNV
            HQ4EFgQUNsO8KZaFrCdG9XXUmdKdhrf352UwDQYJKoZIhvcNAQELBQADggEBAEuC
            7ZAY8X26vBWDUHIBwn+8UjQBmhQHTanlFzXlxshUg0NoDTIeOBnvmenXlchsCga6
            zeDYr08aeUUFA7p6Q9cZfTIGsJXymtyFA8t63e+pIz28IpVonI57jG2AFVlhAtEg
            Y+QvlwyI0NQHTrbjNx/0KjHLgqz2WauWuo+kAEyWsTDQk+nlMJ7SG++CD08GETQN
            xAqwXNCoHKeXHuVpzgRjAFaXN3DBWLe3vb7eeJFeu2sVM1gKhhvWDU5PmBH9Aymr
            ICra39RV6nNwWgNTyfiN4xBvLCbAbFd2viosc0dZo9kk05S8oBHtuPJ7diPEi9GN
            QWl11m2jNREqqUQEkCo=
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ id                    = "66944529544721065207896626692832922643" -> (known after apply)
      ~ key_algorithm         = "RSA" -> (known after apply)
      ~ private_key_pem       = (sensitive value)
      + set_authority_key_id  = false
      + set_subject_key_id    = false
      ~ validity_end_time     = "2025-02-14T22:47:05.022489-05:00" -> (known after apply)
      ~ validity_start_time   = "2023-02-15T10:47:05.022489-05:00" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ subject { # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```